#+TITLE: Answers to DM1 Week 03 EPPs
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t d:(not "HINT")
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup
#+SCORE: 0
* Score Calculation
#+BEGIN_SRC emacs-lisp
  (setq
   EX '((WRP . 0) (TOJ . 0) (WRU . 0) (TOL . 0) (TUK . 0)
        (WVQ . 0) (TUQ . 0) (WVU . 0) (TVL . 0) (TXG . 0))
   Ex (/ (float (apply '+ (mapcar 'cdr EX))) (length EX))
   PR '((WZO . 0) (TOU . 0) (TLI . 0) (WPI . 0) (TTV . 0)
        (WUZ . 0) (TUW . 0) (WWS . 0) (TKH . 0) (WUE . 0))
   Pr (/ (apply '+ (mapcar 'cdr PR)) 10.0 (length PR))
   MMP (+ .0 .0 .0)
   Pu (+ MMP)
   spelling-errors 0
   Mc .0
   Todos-missed 21
   incorrect-timing 21
   No-Report 10
   Tt (- 100 Todos-missed incorrect-timing No-Report)
   score (* (+ (* Ex Pr) Pu Mc) Tt))
#+END_SRC

#+RESULTS:
: 0.0

** TKH
#+begin_info
#+BEGIN_SRC emacs-lisp :results silent
  (defun for-all-for-all (predicate domain-x domain-y)
    "Nested-loop for-all (always) for-all (always)."
    (loop for x across domain-x
          always (loop for y across domain-y
                       always (funcall predicate x y))))

  (defun for-all-for-some (predicate domain-x domain-y)
    "Nested-loop for-all (always) for-some (thereis)."
    (loop for x across domain-x
          always (loop for y across domain-y
                       thereis (funcall predicate x y))))

  (defun for-some-for-all (predicate domain-x domain-y)
    "Nested-loop for-some (thereis) for-all (always)."
    (loop for x across domain-x
          thereis (loop for y across domain-y
                        always (funcall predicate x y))))

  (defun for-some-for-some (predicate domain-x domain-y)
    "Nested-loop for-some (thereis) for-some (thereis)."
    (loop for x across domain-x
          thereis (loop for y across domain-y
                        thereis (funcall predicate x y))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (for-all-for-all '> [4 5 6] [1 2 3])
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
  (for-all-for-some '> [4 5 6] [3 6 9])
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
  (for-some-for-all '> [4 5 6] [3 4 5])
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
  (for-some-for-some '> [4 5 6] [5 6 7])
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp :results raw
  (for-all-for-all '< [4 5 6] [1 2 3])
#+END_SRC

#+RESULTS:
nil

#+BEGIN_SRC emacs-lisp :results raw
  (for-all-for-some '> [4 5 6] [7 8 9])
#+END_SRC

#+RESULTS:
nil

#+BEGIN_SRC emacs-lisp :results raw
  (for-some-for-all '> [4 5 6] [7 8 9])
#+END_SRC

#+RESULTS:
nil

#+BEGIN_SRC emacs-lisp :results raw
  (for-some-for-some '> [4 5 6] [7 8 9])
#+END_SRC

#+RESULTS:
nil
#+end_info
